Repository: igorcferreira/GHActionTrigger
Catalog: Sources/GHActionTriggerCLI/Resources/en.lproj/Localizable.xcstrings
Source language: en
Languages: es, pt

# login.error.noClientId
source: Error: No GitHub OAuth App Client ID configured.
es: Error: No se ha configurado el Client ID de OAuth App de GitHub.
pt: Erro: Nenhum Client ID de OAuth App do GitHub configurado.

# login.instructions.header
source: To authenticate, you need to:
es: Para autenticarse, necesita:
pt: Para autenticar, você precisa:

# login.instructions.step1
source: 1. Create a GitHub OAuth App at https://github.com/settings/developers
es: 1. Crear una OAuth App de GitHub en https://github.com/settings/developers
pt: 1. Criar uma OAuth App do GitHub em https://github.com/settings/developers

# login.instructions.step2
source: 2. Enable 'Device Authorization Flow' in the app settings
es: 2. Habilitar 'Device Authorization Flow' en la configuración de la aplicación
pt: 2. Habilitar 'Device Authorization Flow' nas configurações da aplicação

# login.instructions.step3
source: 3. Either:
es: 3. O:
pt: 3. Ou:

# login.instructions.step3a
source: - Set GHACTIONTRIGGER_CLIENT_ID environment variable
es: - Configurar la variable de entorno GHACTIONTRIGGER_CLIENT_ID
pt: - Definir a variável de ambiente GHACTIONTRIGGER_CLIENT_ID

# login.instructions.step3b
source: - Or use --client-id flag with your Client ID
es: - O usar la opción --client-id con su Client ID
pt: - Ou usar a flag --client-id com seu Client ID

# login.instructions.alternative
source: Alternatively, use a Personal Access Token:
es: Alternativamente, use un Personal Access Token:
pt: Alternativamente, use um Personal Access Token:

# login.instructions.alternativeCommand
source: ghaction auth token --token <your-pat>
es: ghaction auth token --token <su-pat>
pt: ghaction auth token --token <seu-pat>

# login.starting
source: Starting GitHub authentication...
es: Iniciando autenticación de GitHub...
pt: Iniciando autenticação do GitHub...

# login.success
source: ✓ Successfully authenticated with GitHub!
es: ✓ Autenticado exitosamente con GitHub!
pt: ✓ Autenticado com sucesso no GitHub!

# login.success.scopes
source: Scopes: %@
es: Alcances: %@
pt: Escopos: %@

# login.failed
source: ✗ Authentication failed: %@
es: ✗ Error de autenticación: %@
pt: ✗ Falha na autenticação: %@

# login.deviceFlow.title
source: │ GitHub Device Authorization │
es: │ Autorización de Dispositivo de GitHub │
pt: │ Autorização de Dispositivo do GitHub │

# login.deviceFlow.openUrl
source: │ 1. Open: %@
es: │ 1. Abrir: %@
pt: │ 1. Abrir: %@

# login.deviceFlow.enterCode
source: │ 2. Enter code: %@
es: │ 2. Ingresar código: %@
pt: │ 2. Inserir código: %@

# login.deviceFlow.waiting
source: Waiting for authorization...
es: Esperando autorización...
pt: Aguardando autorização...

# token.prompt
source: Enter your GitHub Personal Access Token:
es: Ingrese su Personal Access Token de GitHub:
pt: Insira seu Personal Access Token do GitHub:

# token.error.noTokenProvided
source: No token provided.
es: No se proporcionó ningún token.
pt: Nenhum token fornecido.

# token.error.emptyToken
source: Token cannot be empty.
es: El token no puede estar vacío.
pt: O token não pode estar vazio.

# token.validating
source: Validating token...
es: Validando token...
pt: Validando token...

# token.success
source: ✓ Token validated and stored successfully!
es: ✓ Token validado y almacenado exitosamente!
pt: ✓ Token validado e armazenado com sucesso!

# token.success.type
source: Token type: %@
es: Tipo de token: %@
pt: Tipo de token: %@

# token.error.invalid
source: ✗ Invalid token. Please check your token and try again.
es: ✗ Token no válido. Por favor, verifique su token e inténtelo de nuevo.
pt: ✗ Token inválido. Por favor, verifique seu token e tente novamente.

# token.error.storeFailed
source: ✗ Failed to store token: %@
es: ✗ Error al almacenar el token: %@
pt: ✗ Falha ao armazenar token: %@

# logout.confirmation
source: This will remove all stored GitHub credentials.
es: Esto eliminará todas las credenciales de GitHub almacenadas.
pt: Isso removerá todas as credenciais do GitHub armazenadas.

# logout.confirmationPrompt
source: Continue? [y/N]
es: ¿Continuar? [s/N]
pt: Continuar? [s/N]

# logout.cancelled
source: Cancelled.
es: Cancelado.
pt: Cancelado.

# logout.success
source: ✓ Successfully logged out.
es: ✓ Sesión cerrada exitosamente.
pt: ✓ Logout realizado com sucesso.

# logout.failed
source: ✗ Failed to logout: %@
es: ✗ Error al cerrar sesión: %@
pt: ✗ Falha ao fazer logout: %@

# status.authenticated
source: ✓ Authenticated with GitHub
es: ✓ Autenticado con GitHub
pt: ✓ Autenticado com o GitHub

# status.authenticated.provider
source: Provider: %@
es: Proveedor: %@
pt: Provedor: %@

# status.authenticated.tokenType
source: Token type: %@
es: Tipo de token: %@
pt: Tipo de token: %@

# status.authenticated.scopes
source: Scopes: %@
es: Alcances: %@
pt: Escopos: %@

# status.authenticated.expires
source: Expires: %@
es: Expira: %@
pt: Expira em: %@

# status.notAuthenticated
source: ✗ Not authenticated
es: ✗ No autenticado
pt: ✗ Não autenticado

# status.notAuthenticated.instruction1
source: Run 'ghaction auth login' to authenticate
es: Ejecute 'ghaction auth login' para autenticarse
pt: Execute 'ghaction auth login' para autenticar

# status.notAuthenticated.instruction2
source: Or set GITHUB_TOKEN environment variable
es: O configure la variable de entorno GITHUB_TOKEN
pt: Ou defina a variável de ambiente GITHUB_TOKEN

# trigger.invalidInputFormat
source: ✗ Invalid input format: '%@'
es: ✗ Formato de entrada no válido: '%@'
pt: ✗ Formato de entrada inválido: '%@'

# trigger.invalidInputFormat.expected
source: Expected format: key=value
es: Formato esperado: clave=valor
pt: Formato esperado: chave=valor

# trigger.triggering
source: Triggering workflow '%@' on %@/%@...
es: Ejecutando workflow '%@' en %@/%@...
pt: Disparando workflow '%@' em %@/%@...

# trigger.inputs
source: Inputs: %@
es: Entradas: %@
pt: Entradas: %@

# trigger.success
source: ✓ Workflow dispatch triggered successfully!
es: ✓ Ejecución del workflow disparada exitosamente!
pt: ✓ Disparo do workflow executado com sucesso!

# trigger.waiting
source: Waiting for workflow run to start...
es: Esperando que comience la ejecución del workflow...
pt: Aguardando o início da execução do workflow...

# trigger.warning.notFound
source: ⚠ Could not find workflow run. Check manually:
es: ⚠ No se pudo encontrar la ejecución del workflow. Verifique manualmente:
pt: ⚠ Não foi possível encontrar a execução do workflow. Verifique manualmente:

# trigger.foundRun
source: Found run #%lld (ID: %lld)
es: Encontrada ejecución #%lld (ID: %lld)
pt: Encontrada execução #%lld (ID: %lld)

# trigger.viewAt
source: View at: %@
es: Ver en: %@
pt: Ver em: %@

# trigger.viewAtGeneric
source: View at: https://github.com/%@/%@/actions
es: Ver en: https://github.com/%@/%@/actions
pt: Ver em: https://github.com/%@/%@/actions

# trigger.error.failed
source: ✗ Failed to trigger workflow: %@
es: ✗ Error al disparar el workflow: %@
pt: ✗ Falha ao disparar workflow: %@

# trigger.runStatus
source: Run status: %@
es: Estado de la ejecución: %@
pt: Status da execução: %@

# trigger.jobs
source: Jobs:
es: Trabajos:
pt: Trabalhos:

# trigger.runStatus.completedByJobs
source: Run status: Completed (detected via jobs)
es: Estado de la ejecución: Completada (detectado mediante trabajos)
pt: Status da execução: Concluída (detectado via trabalhos)

# trigger.status.queued
source: Queued
es: En cola
pt: Na fila

# trigger.status.inProgress
source: In Progress
es: En progreso
pt: Em andamento

# trigger.status.completed
source: Completed
es: Completada
pt: Concluída

# trigger.status.waiting
source: Waiting
es: Esperando
pt: Aguardando

# trigger.status.requested
source: Requested
es: Solicitada
pt: Solicitada

# trigger.status.pending
source: Pending
es: Pendiente
pt: Pendente

# trigger.jobStatus.queued
source: queued
es: en cola
pt: na fila

# trigger.jobStatus.running
source: running
es: ejecutando
pt: executando

# trigger.jobStatus.waiting
source: waiting
es: esperando
pt: aguardando

# trigger.jobStatus.completed
source: completed
es: completado
pt: concluído

# trigger.jobStatus.pending
source: pending
es: pendiente
pt: pendente

# trigger.jobStatus.requested
source: requested
es: solicitado
pt: solicitado

# trigger.jobStatus.unknown
source: unknown
es: desconocido
pt: desconhecido

# trigger.finalJobResults
source: Final job results:
es: Resultados finales de los trabajos:
pt: Resultados finais dos trabalhos:

# trigger.result.success
source: ✓ Workflow run completed successfully!
es: ✓ Ejecución del workflow completada exitosamente!
pt: ✓ Execução do workflow concluída com sucesso!

# trigger.result.failed
source: ✗ Workflow run failed.
es: ✗ La ejecución del workflow falló.
pt: ✗ Execução do workflow falhou.

# trigger.result.cancelled
source: ⚠ Workflow run was cancelled.
es: ⚠ La ejecución del workflow fue cancelada.
pt: ⚠ Execução do workflow foi cancelada.

# trigger.result.skipped
source: ⚠ Workflow run was skipped.
es: ⚠ La ejecución del workflow fue omitida.
pt: ⚠ Execução do workflow foi ignorada.

# trigger.result.timedOut
source: ✗ Workflow run timed out.
es: ✗ La ejecución del workflow agotó el tiempo.
pt: ✗ Execução do workflow expirou.

# trigger.result.otherConclusion
source: ⚠ Workflow run completed with conclusion: %@
es: ⚠ Ejecución del workflow completada con conclusión: %@
pt: ⚠ Execução do workflow concluída com conclusão: %@

# trigger.result.unknownConclusion
source: ⚠ Workflow run completed with unknown conclusion.
es: ⚠ Ejecución del workflow completada con conclusión desconocida.
pt: ⚠ Execução do workflow concluída com conclusão desconhecida.

# runs.list.noRuns
source: No workflow runs found.
es: No se encontraron ejecuciones de workflow.
pt: Nenhuma execução de workflow encontrada.

# runs.list.header
source: Recent workflow runs for %@/%@:
es: Ejecuciones recientes de workflow para %@/%@:
pt: Execuções recentes de workflow para %@/%@:

# runs.list.status
source: Status: %@
es: Estado: %@

# runs.list.statusWithConclusion
source: Status: %@, %@
es: Estado: %@, %@

# runs.list.details
source: Branch: %@ | Event: %@ | %@
es: Rama: %@ | Evento: %@ | %@
pt: Branch: %@ | Evento: %@ | %@

# runs.list.failed
source: ✗ Failed to list runs: %@
es: ✗ Error al listar ejecuciones: %@
pt: ✗ Falha ao listar execuções: %@

# runs.get.header
source: Workflow Run #%lld
es: Ejecución de Workflow #%lld
pt: Execução de Workflow #%lld

# runs.get.name
source: Name: %@
es: Nombre: %@
pt: Nome: %@

# runs.get.status
source: Status: %@
es: Estado: %@

# runs.get.conclusion
source: Conclusion: %@
es: Conclusión: %@
pt: Conclusão: %@

# runs.get.event
source: Event: %@
es: Evento: %@
pt: Evento: %@

# runs.get.branch
source: Branch: %@
es: Rama: %@

# runs.get.attempt
source: Attempt: %lld
es: Intento: %lld
pt: Tentativa: %lld

# runs.get.created
source: Created: %@
es: Creado: %@
pt: Criado em: %@

# runs.get.updated
source: Updated: %@
es: Actualizado:%@
pt: Atualizado: %@

# runs.get.failed
source: ✗ Failed to get run: %@
es: ✗ Error al obtener la ejecución: %@
pt: ✗ Falha ao obter execução: %@

# runs.watch.watching
source: Watching workflow run #%lld (%@)...
es: Monitoreando ejecución del workflow #%lld (%@)...
pt: Observando execução do workflow #%lld (%@)...

# runs.watch.failed
source: ✗ Failed to watch run: %@
es: ✗ Error al monitorear la ejecución: %@
pt: ✗ Falha ao observar execução: %@
